const fs = require("fs-extra");
const axios = require("axios");
const moment = require("moment-timezone");

const baseApiUrl = async () => {
  const base = await axios.get('https://raw.githubusercontent.com/nazrul4x/Noobs/main/Apis.json');
  return base.data.dipto;
};

module.exports = {
  config: {
    name: "bot",
    version: "1.6.9",
    author: "Nazrul", // don't change author
    countDown: 5,
    role: 0,
    usePrefix: true,
    isPremium: false,
    shortDescription: "Charming and Stylish Bot",
    description: "fun with bot",
    category: "fun",
    guide: {
      en: "use Bot & bby or Baby",
    },
  },

  onStart: async function () {
    console.log("✨ The bot is online and ready to charm you!");
  },

  onChat: async function ({ api, event, args, Threads, usersData }) {
    const { threadID, messageID, senderID, body } = event;
    if (!body) return;

    const uid = senderID;
    const data = await usersData.get(senderID);
    const name = data?.name || "Darling";
    const time = moment.tz("Asia/Dhaka").format("hh:mm:ss A");

    const mentions = [{ id: senderID, tag: name }];
    const messages = ["ও মিম ও মিম-😇-তুমি কেন চুরি করলা সাদিয়ার ফর্সা হওয়ার ক্রীম-🌚🤧","-অনুমতি দিলাম-𝙋𝙧𝙤𝙥𝙤𝙨𝙚 কর বস হুসাইন কে-🐸😾🔪","-𝙂𝙖𝙮𝙚𝙨-🤗-যৌবনের কসম দিয়ে আমারে 𝐁𝐥𝐚𝐜𝐤𝐦𝐚𝐢𝐥 করা হচ্ছে-🥲🤦‍♂️🤧","-𝗢𝗶𝗶 আন্টি-🙆‍♂️-তোমার মেয়ে চোখ মারে-🥺🥴🐸","তাকাই আছো কেন চুমু দিবা-🙄🐸😘","আজকে প্রপোজ করে দেখো রাজি হইয়া যামু-😌🤗😇","-আমার গল্পে তোমার নানি সেরা-🙊🙆‍♂️🤗","কি বেপার আপনি শ্বশুর বাড়িতে যাচ্ছেন না কেন-🤔🥱🌻","দিনশেষে পরের 𝐁𝐎𝐖 সুন্দর-☹️🤧","-তাবিজ কইরা হইলেও ফ্রেম এক্কান করমুই তাতে যা হই হোক-🤧🥱🌻","-ছোটবেলা ভাবতাম বিয়ে করলে অটোমেটিক বাচ্চা হয়-🥱-ওমা এখন দেখি কাহিনী অন্যরকম-😦🙂🌻","-আজ একটা বিন নেই বলে ফেসবুকের নাগিন-🤧-গুলোরে আমার বস হুসাইন ধরতে পারছে না-🐸🥲","-চুমু থাকতে তোরা বিড়ি খাস কেন বুঝা আমারে-😑😒🐸⚒️","—যে ছেড়ে গেছে-😔-তাকে ভুলে যাও-🙂-আমার বস হুসাইন এর সাথে  প্রেম করে তাকে দেখিয়ে দাও-🙈🐸🤗","—হাজারো লুচ্চা লুচ্চির ভিরে-🙊🥵আমার বস হুসাইন এক নিস্পাপ ভালো মানুষ-🥱🤗🙆‍♂️","-রূপের অহংকার করো না-🙂❤️চকচকে সূর্যটাও দিনশেষে অন্ধকারে পরিণত হয়-🤗💜","সুন্দর মাইয়া মানেই-🥱আমার বস হুসাইন এর বউ-😽🫶আর বাকি গুলো আমার বেয়াইন-🙈🐸🤗","এত অহংকার করে লাভ নেই-🌸মৃত্যুটা নিশ্চিত শুধু সময়টা অ'নিশ্চিত-🖤🙂","-দিন দিন কিছু মানুষের কাছে অপ্রিয় হয়ে যাইতেছি-🙂😿🌸","হুদাই আমারে  শয়তানে লারে-😝😑☹️","-𝗜 𝗟𝗢𝗩𝗢 𝗬𝗢𝗨-😽-আহারে ভাবছো তোমারে প্রোপজ করছি-🥴-থাপ্পর দিয়া কিডনী লক করে দিব-😒-ভুল পড়া বের করে দিবো-🤭🐸","-আমি একটা দুধের শিশু-😇-🫵𝗬𝗢𝗨🐸💦","-কতদিন হয়ে গেলো বিছনায় মুতি না-😿-মিস ইউ নেংটা কাল-🥺🤧","-বালিকা━👸-𝐃𝐨 𝐲𝐨𝐮-🫵-বিয়া-𝐦𝐞-😽-আমি তোমাকে-😻-আম্মু হইতে সাহায্য করব-🙈🥱","-এই আন্টির মেয়ে-🫢🙈-𝐔𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐚𝐡-😽🫶-আসলেই তো স্বাদ-🥵💦-এতো স্বাদ কেন-🤔-সেই স্বাদ-😋","-ইস কেউ যদি বলতো-🙂-আমার শুধু  তোমাকেই লাগবে-💜🌸","-ওই বেডি তোমার বাসায় না আমার বস হুসাইন মেয়ে দেখতে গেছিলো-🙃-নাস্তা আনারস আর দুধ দিছো-🙄🤦‍♂️-বইন কইলেই তো হয় বয়ফ্রেন্ড আছে-🥺🤦‍♂-আমার বস হুসাইন কে জানে মারার কি দরকার-🙄🤧","-একদিন সে ঠিকই ফিরে তাকাবে-😇-আর মুচকি হেসে বলবে ওর মতো আর কেউ ভালবাসেনি-🙂😅","-হুদাই গ্রুপে আছি-🥺🐸-কেও ইনবক্সে নক দিয়ে বলে না জান তোমারে আমি অনেক ভালোবাসি-🥺🤧","কি'রে গ্রুপে দেখি একটাও বেডি নাই-🤦‍🥱💦","-দেশের সব কিছুই চুরি হচ্ছে-🙄-শুধু আমার বস হুসাইন এর মনটা ছাড়া-🥴😑😏","-🫵তোমারে প্রচুর ভাল্লাগে-😽-সময় মতো প্রপোজ করমু বুঝছো-🔨😼-ছিট খালি রাইখো- 🥱🐸🥵","-আজ থেকে আর কাউকে পাত্তা দিমু না -!😏-কারণ আমি ফর্সা হওয়ার ক্রিম কিনছি -!🙂🐸","বেশি Bot Bot করলে leave নিবো কিন্তু😒😒 " , "শুনবো না😼 তুমি আমাকে প্রেম করাই দাও নি🥺 পচা তুমি🥺 " , "আমি আবাল দের সাতে কথা বলি না,ok😒" , "এত কাছেও এসো না,প্রেম এ পরে যাবো তো 🙈" , "Bolo Babu, তুমি কি আমাকে ভালোবাসো? 🙈💋 " , "বার বার ডাকলে মাথা গরম হয় কিন্তু😑", "হা বলো😒,কি করতে পারি😐😑?" , "এতো ডাকছিস কোনো?গালি শুনবি নাকি? 🤬","মেয়ে হলে বস ফারহান এর সাথে প্রেম করো🙈??. " ,  "আরে Bolo আমার জান ,কেমন আসো?😚 " , "Bot বলে অসম্মান করচ্ছিছ,😰😿" , "Hop bedi😾,Boss বল boss😼" , "চুপ থাক ,নাই তো তোর দাত ভেগে দিবো কিন্তু" , "Bot না , জানু বল জানু 😘 " , "বার বার Disturb করেছিস কোনো😾,আমার বস ফারহান এর সাথে ব্যাস্ত আসি😋" , "আমি গরীব এর সাথে কথা বলি না😼😼" , "আমাকে ডাকলে ,আমি কিন্তূ কিস করে দেবো😘"];

    const currentHour = moment.tz("Asia/Dhaka").hour();
    let greeting;

    if (currentHour < 12) {
      greeting = `Good Morning, Hello ${name}!`;
    } else if (currentHour < 18) {
      greeting = `Good Evening, Hello ${name}!`;
    } else {
      greeting = `Good Night, Hello ${name}!`;
    }

    const nazruls = body.toLowerCase();
    if (
      nazruls.startsWith("bot") ||
      nazruls.startsWith("bby") ||
      nazruls.startsWith("baby") ||
      nazruls.startsWith("বট") ||
      nazruls.startsWith("robot") ||
      nazruls.startsWith("bbe")
    ) {
      const userInput = body.trim();
      const isQuestion = userInput.split(" ").length > 1;

      if (isQuestion) {
        const question = userInput.slice(userInput.indexOf(" ") + 1).trim();
        try {
          const response = await axios.get(`${await baseApiUrl()}/baby?text=${encodeURIComponent(question)}&senderID=${uid}&font=0`);
          const replyMsg = response.data.reply;

          return api.sendMessage(replyMsg, threadID, (error, info) => {
            if (!error) {
              global.GoatBot.onReply.set(info.messageID, {
                commandName: this.config.name,
                type: "reply",
                author: senderID,
              });
            }
          }, messageID);
        } catch (error) {
          console.error("error:", error);
          return api.sendMessage("😞 error bby", threadID, messageID);
        }
      } else {
        const randMessage = messages[Math.floor(Math.random() * messages.length)];
        const msg = `${randMessage}\n`;

        return api.sendMessage({ body: msg, mentions: [{ id: uid, tag: name }] }, threadID, (error, info) => {
          if (!error) {
            global.GoatBot.onReply.set(info.messageID, {
              commandName: this.config.name,
              type: "reply",
              author: senderID,
            });
          }
        }, messageID);
      }
    }
  },

  onReply: async function ({ api, event, args }) {
    if (event.type !== "message_reply") return;
    const nazrul = args.join(" ");
    const uid = event.senderID;

    try {
      const response = await axios.get(`${await baseApiUrl()}/baby?text=${encodeURIComponent(nazrul)}&senderID=${uid}&font=0`);
      const replyMsg = response.data.reply;

      return api.sendMessage(replyMsg, event.threadID, (error, info) => {
        if (!error) {
          global.GoatBot.onReply.set(info.messageID, {
            commandName: this.config.name,
            type: "reply",
            author: event.senderID,
          });
        }
      }, event.messageID);
    } catch (error) {
      console.error("error:", error);
      return api.sendMessage("😞 error bby", event.threadID, event.messageID);
    }
  }
};
